---
kind: property
id: P:Autodesk.Revit.DB.ColorOptions.PreselectionColor
source: html/fe1cb0fa-fb39-eaf2-f3bd-fa38ef001a4f.htm
---
# Autodesk.Revit.DB.ColorOptions.PreselectionColor Property

The color of the current canvas theme used to highlight candidates for selection before they are selected.

## Syntax (C#)
```csharp
public Color PreselectionColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null